In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature":[42,40,34],
})
df1

       city  temperature
0  new york           42
1   chicago           40
2   orlando           34

In [3]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando"],
    "humidity":[65,60,75],
})
df2

       city  humidity
0   chicago        65
1  new york        60
2   orlando        75

In [4]:
df3 = pd.merge(df1,df2,on="city")
df3

       city  temperature  humidity
0  new york           42        60
1   chicago           40        65
2   orlando           34        75

In [5]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando","baltimore"],
    "temperature":[42,40,34,28],
})
df1

        city  temperature
0   new york           42
1    chicago           40
2    orlando           34
3  baltimore           28

In [6]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","san francisco"],
    "humidity":[65,60,75],
})
df2

            city  humidity
0        chicago        65
1       new york        60
2  san francisco        75

In [7]:
df3 = pd.merge(df1,df2,on="city")
df3

       city  temperature  humidity
0  new york           42        60
1   chicago           40        65

In [8]:
df3 = pd.merge(df1,df2,on="city",how="outer")
df3

            city  temperature  humidity
0       new york         42.0      60.0
1        chicago         40.0      65.0
2        orlando         34.0       NaN
3      baltimore         28.0       NaN
4  san francisco          NaN      75.0

In [9]:
df3 = pd.merge(df1,df2,on="city",how="right")
df3

            city  temperature  humidity
0       new york         42.0        60
1        chicago         40.0        65
2  san francisco          NaN        75

In [10]:
df3 = pd.merge(df1,df2,on="city",how="outer",indicator=True)
df3

            city  temperature  humidity      _merge
0       new york         42.0      60.0        both
1        chicago         40.0      65.0        both
2        orlando         34.0       NaN   left_only
3      baltimore         28.0       NaN   left_only
4  san francisco          NaN      75.0  right_only

In [11]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando","baltimore"],
    "temperature":[42,40,34,28],
    "humidity":[65,68,72,75]
})
df1

        city  temperature  humidity
0   new york           42        65
1    chicago           40        68
2    orlando           34        72
3  baltimore           28        75

In [12]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","san francisco"],
    "temperature":[21,14,35],
    "humidity":[65,60,75],
})
df2

            city  temperature  humidity
0        chicago           21        65
1       new york           14        60
2  san francisco           35        75

In [13]:
df3 = pd.merge(df1,df2,on="city")
df3

       city  temperature_x  humidity_x  temperature_y  humidity_y
0  new york             42          65             14          60
1   chicago             40          68             21          65

In [14]:
df3 = pd.merge(df1,df2,on="city",suffixes=('left','right'))
df3

       city  temperatureleft  humidityleft  temperatureright  humidityright
0  new york               42            65                14             60
1   chicago               40            68                21             65